[Survived] ArrayDeclaration
components/eatingMinigame.js:7:18
 const questionsData = [
     {
         question: 'What is the chemical symbol for oxygen?',
-        answers: ['H2O', 'O2', 'CO2', 'N2'],
+        answers: [],
         correctAnswerIndex: 1,
     },

[Survived] StringLiteral
components/eatingMinigame.js:12:38
     },
     {
         question: 'Which planet is known as the Red Planet?',
-        answers: ['Mars', 'Jupiter', 'Venus', 'Saturn'],
+        answers: ['Mars', 'Jupiter', "", 'Saturn'],
         correctAnswerIndex: 0,
     },

[Survived] ObjectLiteral
components/eatingMinigame.js:15:5
         answers: ['Mars', 'Jupiter', 'Venus', 'Saturn'],
         correctAnswerIndex: 0,
     },
-    {
-        question: 'What is the process of converting light energy into chemical energy in plants?',
-        answers: ['Respiration', 'Transpiration', 'Photosynthesis', 'Fermentation'],
-        correctAnswerIndex: 2,
-    },
+    {},
     {
         question: 'What gas do humans exhale during respiration?',

[Survived] StringLiteral
components/eatingMinigame.js:16:19
         correctAnswerIndex: 0,
     },
     {
-        question: 'What is the process of converting light energy into chemical energy in plants?',
+        question: "",
         answers: ['Respiration', 'Transpiration', 'Photosynthesis', 'Fermentation'],
         correctAnswerIndex: 2,

[Survived] StringLiteral
components/eatingMinigame.js:17:19
     },
     {
         question: 'What is the process of converting light energy into chemical energy in plants?',
-        answers: ['Respiration', 'Transpiration', 'Photosynthesis', 'Fermentation'],
+        answers: ["", 'Transpiration', 'Photosynthesis', 'Fermentation'],
         correctAnswerIndex: 2,
     },

[Survived] ArrayDeclaration
components/eatingMinigame.js:22:18
     },
     {
         question: 'What gas do humans exhale during respiration?',
-        answers: ['Oxygen', 'Carbon Dioxide', 'Nitrogen', 'Hydrogen'],
+        answers: [],
         correctAnswerIndex: 1,
     },

[Survived] StringLiteral
components/eatingMinigame.js:22:59
     },
     {
         question: 'What gas do humans exhale during respiration?',
-        answers: ['Oxygen', 'Carbon Dioxide', 'Nitrogen', 'Hydrogen'],
+        answers: ['Oxygen', 'Carbon Dioxide', 'Nitrogen', ""],
         correctAnswerIndex: 1,
     },

[Survived] StringLiteral
components/eatingMinigame.js:27:56
     },
     {
         question: 'What is the largest mammal on Earth?',
-        answers: ['Elephant', 'Blue Whale', 'Giraffe', 'Hippopotamus'],
+        answers: ['Elephant', 'Blue Whale', 'Giraffe', ""],
         correctAnswerIndex: 1,
     },

[Survived] StringLiteral
components/eatingMinigame.js:27:19
     },
     {
         question: 'What is the largest mammal on Earth?',
-        answers: ['Elephant', 'Blue Whale', 'Giraffe', 'Hippopotamus'],
+        answers: ["", 'Blue Whale', 'Giraffe', 'Hippopotamus'],
         correctAnswerIndex: 1,
     },

[NoCoverage] BooleanLiteral
components/eatingMinigame.js:34:46
 
 const MiniGame = () => {
     const [currentQuestionIndex, setCurrentQuestionIndex] = useState(0);
-    const [gameOver, setGameOver] = useState(false);
+    const [gameOver, setGameOver] = useState(true);
     const [hoveredIndex, setHoveredIndex] = useState(null);
     const [score, setScore] = useState(0);

[NoCoverage] BlockStatement
components/eatingMinigame.js:38:60
     const [hoveredIndex, setHoveredIndex] = useState(null);
     const [score, setScore] = useState(0);
 
-    const handleAnswerSelection = (selectedAnswerIndex) => {
-        const currentQuestion = questionsData[currentQuestionIndex];
-        if (selectedAnswerIndex === currentQuestion.correctAnswerIndex) {
-            setScore(score + 1);
-        }
-
-        if (currentQuestionIndex === questionsData.length - 1) {
-            setGameOver(true);
-        } else {
-            setCurrentQuestionIndex(currentQuestionIndex + 1);
-        }
-    };
+    const handleAnswerSelection = (selectedAnswerIndex) => {};
 
     if (gameOver) {

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:40:13
 
     const handleAnswerSelection = (selectedAnswerIndex) => {
         const currentQuestion = questionsData[currentQuestionIndex];
-        if (selectedAnswerIndex === currentQuestion.correctAnswerIndex) {
+        if (true) {
             setScore(score + 1);
         }

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:40:13
 
     const handleAnswerSelection = (selectedAnswerIndex) => {
         const currentQuestion = questionsData[currentQuestionIndex];
-        if (selectedAnswerIndex === currentQuestion.correctAnswerIndex) {
+        if (false) {
             setScore(score + 1);
         }

[NoCoverage] ArithmeticOperator
components/eatingMinigame.js:41:22
     const handleAnswerSelection = (selectedAnswerIndex) => {
         const currentQuestion = questionsData[currentQuestionIndex];
         if (selectedAnswerIndex === currentQuestion.correctAnswerIndex) {
-            setScore(score + 1);
+            setScore(score - 1);
         }
 

[NoCoverage] EqualityOperator
components/eatingMinigame.js:44:13
             setScore(score + 1);
         }
 
-        if (currentQuestionIndex === questionsData.length - 1) {
+        if (currentQuestionIndex !== questionsData.length - 1) {
             setGameOver(true);
         } else {

[NoCoverage] BlockStatement
components/eatingMinigame.js:44:64
             setScore(score + 1);
         }
 
-        if (currentQuestionIndex === questionsData.length - 1) {
-            setGameOver(true);
-        } else {
+        if (currentQuestionIndex === questionsData.length - 1) {} else {
             setCurrentQuestionIndex(currentQuestionIndex + 1);
         }

[NoCoverage] BooleanLiteral
components/eatingMinigame.js:45:25
         }
 
         if (currentQuestionIndex === questionsData.length - 1) {
-            setGameOver(true);
+            setGameOver(false);
         } else {
             setCurrentQuestionIndex(currentQuestionIndex + 1);

[NoCoverage] BlockStatement
components/eatingMinigame.js:46:16
 
         if (currentQuestionIndex === questionsData.length - 1) {
             setGameOver(true);
-        } else {
-            setCurrentQuestionIndex(currentQuestionIndex + 1);
-        }
+        } else {}
     };
 

[NoCoverage] ArithmeticOperator
components/eatingMinigame.js:47:37
         if (currentQuestionIndex === questionsData.length - 1) {
             setGameOver(true);
         } else {
-            setCurrentQuestionIndex(currentQuestionIndex + 1);
+            setCurrentQuestionIndex(currentQuestionIndex - 1);
         }
     };

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:51:9
         }
     };
 
-    if (gameOver) {
+    if (true) {
         return (
             <View style={styles.container}>

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:51:9
         }
     };
 
-    if (gameOver) {
+    if (false) {
         return (
             <View style={styles.container}>

[NoCoverage] ArrowFunction
components/eatingMinigame.js:98:66
                 <View style={styles.questionContainer}>
                     <Text style={styles.question}>{questionsData[currentQuestionIndex].question}</Text>
                 </View>
-                {questionsData[currentQuestionIndex].answers.map((answer, index) => (
-                    <TouchableOpacity
-                        key={index}
-                        style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
-                        activeOpacity={0.7}
-                        onPress={() => handleAnswerSelection(index)}
-                        onMouseEnter={() => setHoveredIndex(index)}
-                        onMouseLeave={() => setHoveredIndex(null)}
-                    >
-                        <Text style={styles.answerText}>{answer}</Text>
-                    </TouchableOpacity>
-                ))}
+                {questionsData[currentQuestionIndex].answers.map(() => undefined)}
             </View>
         </View>

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:101:54
                 {questionsData[currentQuestionIndex].answers.map((answer, index) => (
                     <TouchableOpacity
                         key={index}
-                        style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
+                        style={[styles.answerButton, false]}
                         activeOpacity={0.7}
                         onPress={() => handleAnswerSelection(index)}

[NoCoverage] ConditionalExpression
components/eatingMinigame.js:101:54
                 {questionsData[currentQuestionIndex].answers.map((answer, index) => (
                     <TouchableOpacity
                         key={index}
-                        style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
+                        style={[styles.answerButton, true]}
                         activeOpacity={0.7}
                         onPress={() => handleAnswerSelection(index)}

[NoCoverage] ArrowFunction
components/eatingMinigame.js:103:34
                         key={index}
                         style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
                         activeOpacity={0.7}
-                        onPress={() => handleAnswerSelection(index)}
+                        onPress={() => undefined}
                         onMouseEnter={() => setHoveredIndex(index)}
                         onMouseLeave={() => setHoveredIndex(null)}

[NoCoverage] ArrowFunction
components/eatingMinigame.js:104:39
                         style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
                         activeOpacity={0.7}
                         onPress={() => handleAnswerSelection(index)}
-                        onMouseEnter={() => setHoveredIndex(index)}
+                        onMouseEnter={() => undefined}
                         onMouseLeave={() => setHoveredIndex(null)}
                     >

[NoCoverage] ArrowFunction
components/eatingMinigame.js:105:39
                         activeOpacity={0.7}
                         onPress={() => handleAnswerSelection(index)}
                         onMouseEnter={() => setHoveredIndex(index)}
-                        onMouseLeave={() => setHoveredIndex(null)}
+                        onMouseLeave={() => undefined}
                     >
                         <Text style={styles.answerText}>{answer}</Text>

[Survived] ObjectLiteral
components/eatingMinigame.js:123:20
         paddingHorizontal: 20,
         backgroundColor: 'transparent',
     },
-    gameContainer: {
-        backgroundColor: 'white',
-        padding: 40,
-        borderRadius: 15,
-        width: '100%',
-        alignItems: 'center',
-        shadowColor: '#000',
-        shadowOffset: {
-            width: 4,
-            height: 4,
-        },
-        shadowOpacity: 0.25,
-        shadowRadius: 3.84,
-        elevation: 5,
-    },
+    gameContainer: {},
     questionContainer: {
         marginBottom: 20,

[Survived] StringLiteral
components/eatingMinigame.js:124:26
         backgroundColor: 'transparent',
     },
     gameContainer: {
-        backgroundColor: 'white',
+        backgroundColor: "",
         padding: 40,
         borderRadius: 15,

[Survived] StringLiteral
components/eatingMinigame.js:127:16
         backgroundColor: 'white',
         padding: 40,
         borderRadius: 15,
-        width: '100%',
+        width: "",
         alignItems: 'center',
         shadowColor: '#000',

[Survived] ObjectLiteral
components/eatingMinigame.js:130:23
         width: '100%',
         alignItems: 'center',
         shadowColor: '#000',
-        shadowOffset: {
-            width: 4,
-            height: 4,
-        },
+        shadowOffset: {},
         shadowOpacity: 0.25,
         shadowRadius: 3.84,

[Survived] ObjectLiteral
components/eatingMinigame.js:141:15
     questionContainer: {
         marginBottom: 20,
     },
-    question: {
-        fontSize: 24,
-        textAlign: 'center',
-        fontFamily: 'Jua-Regular',
-    },
+    question: {},
     answerButton: {
         backgroundColor: 'white',

[Survived] StringLiteral
components/eatingMinigame.js:143:20
     },
     question: {
         fontSize: 24,
-        textAlign: 'center',
+        textAlign: "",
         fontFamily: 'Jua-Regular',
     },

[Survived] StringLiteral
components/eatingMinigame.js:144:21
     question: {
         fontSize: 24,
         textAlign: 'center',
-        fontFamily: 'Jua-Regular',
+        fontFamily: "",
     },
     answerButton: {

[Survived] StringLiteral
components/eatingMinigame.js:147:26
         fontFamily: 'Jua-Regular',
     },
     answerButton: {
-        backgroundColor: 'white',
+        backgroundColor: "",
         paddingVertical: 15,
         paddingHorizontal: 15,

[Survived] StringLiteral
components/eatingMinigame.js:152:16
         paddingHorizontal: 15,
         borderRadius: 10,
         marginVertical: 5,
-        width: '80%',
+        width: "",
         borderColor: 'black',
         borderWidth: 2,

[Survived] StringLiteral
components/eatingMinigame.js:153:22
         borderRadius: 10,
         marginVertical: 5,
         width: '80%',
-        borderColor: 'black',
+        borderColor: "",
         borderWidth: 2,
     },

[Survived] ObjectLiteral
components/eatingMinigame.js:156:17
         borderColor: 'black',
         borderWidth: 2,
     },
-    answerText: {
-        fontSize: 18,
-        textAlign: 'center',
-        fontFamily: 'Jua-Regular',
-    },
+    answerText: {},
     answerButtonHover: {
         backgroundColor: '#e1eefb',

[Survived] StringLiteral
components/eatingMinigame.js:158:20
     },
     answerText: {
         fontSize: 18,
-        textAlign: 'center',
+        textAlign: "",
         fontFamily: 'Jua-Regular',
     },

[Survived] StringLiteral
components/eatingMinigame.js:166:25
     },
     gameOverContainer: {
         alignItems: 'center',
-        justifyContent: 'center',
+        justifyContent: "",
     },
     whiteContainer: {

[Survived] StringLiteral
components/eatingMinigame.js:174:22
         borderRadius: 15,
         alignItems: 'center',
         justifyContent: 'center',
-        shadowColor: '#000',
+        shadowColor: "",
         shadowOffset: {
             width: 4,

[Survived] ObjectLiteral
components/eatingMinigame.js:214:15
         marginTop: 20,
         resizeMode: 'contain',
     },
-    statText :{
-        fontSize: 26,
-        marginRight: 5,
-        fontFamily: 'Jua-Regular',
-    },
+    statText :{},
 });
 
