[NoCoverage] BooleanLiteral
components/FlashCard.js:7:46
 import { useFonts } from "expo-font";
 
 export default function FlashCard({ question, answer }) {
-  const [isFlipped, setIsFlipped] = useState(false);
+  const [isFlipped, setIsFlipped] = useState(true);
   function flipCard() { setIsFlipped(!isFlipped); }
   const [dummy] = useFonts({

[NoCoverage] BooleanLiteral
components/FlashCard.js:8:38
 
 export default function FlashCard({ question, answer }) {
   const [isFlipped, setIsFlipped] = useState(false);
-  function flipCard() { setIsFlipped(!isFlipped); }
+  function flipCard() { setIsFlipped(isFlipped); }
   const [dummy] = useFonts({
     "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),

[NoCoverage] BlockStatement
components/FlashCard.js:8:23
 
 export default function FlashCard({ question, answer }) {
   const [isFlipped, setIsFlipped] = useState(false);
-  function flipCard() { setIsFlipped(!isFlipped); }
+  function flipCard() {}
   const [dummy] = useFonts({
     "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),

[NoCoverage] BooleanLiteral
components/FlashCard.js:18:23
       friction={10}
       perspective={1000}
       flip={isFlipped}
-      flipHorizontal={true}
+      flipHorizontal={false}
       flipVertical={false}
       clickable={true}

[NoCoverage] BooleanLiteral
components/FlashCard.js:19:21
       perspective={1000}
       flip={isFlipped}
       flipHorizontal={true}
-      flipVertical={false}
+      flipVertical={true}
       clickable={true}
     >

[NoCoverage] BooleanLiteral
components/FlashCard.js:20:18
       flip={isFlipped}
       flipHorizontal={true}
       flipVertical={false}
-      clickable={true}
+      clickable={false}
     >
       <TouchableOpacity style={[styles.card, styles.cardFront]} onPress={flipCard}>

[NoCoverage] StringLiteral
components/FlashCard.js:23:36
       clickable={true}
     >
       <TouchableOpacity style={[styles.card, styles.cardFront]} onPress={flipCard}>
-        <Text style={{ fontFamily: 'Jua-Regular' }}>{question}</Text>
+        <Text style={{ fontFamily: "" }}>{question}</Text>
       </TouchableOpacity>
 

[Survived] StringLiteral
components/FlashCard.js:37:21
   card: {
     fontSize: 10,
     flex: 1,
-    justifyContent: 'center',
+    justifyContent: "",
     alignItems: 'center',
     borderRadius: 20,

[Survived] StringLiteral
components/FlashCard.js:48:18
     margin: 10,
     padding: 15,
     width: 135,
-    shadowColor: '#000',
+    shadowColor: "",
     shadowOffset: { width: 0, height: 5 },
     shadowOpacity: 0.25,

[Survived] StringLiteral
components/FlashCard.js:55:22
     elevation: 3,
   },
   cardFront: {
-    backgroundColor: '#e1eefb',
+    backgroundColor: "",
   },
   cardBack: {

[Survived] StringLiteral
components/FlashCard.js:62:22
   },
 });
 
-const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
+const myflshcardQ = ["",'how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
 const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
 const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  

[Survived] StringLiteral
components/FlashCard.js:62:112
   },
 });
 
-const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
+const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?',"",'can i have some more free samples'];  
 const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
 const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  

[Survived] ArrowFunction
components/FlashCard.js:63:33
 });
 
 const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
-const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
+const myListq = myflshcardQ.map(() => undefined) 
 const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  
 const myLista = myflshcardA.map((item) => <p>{item}</p>)

[Survived] ArrayDeclaration
components/FlashCard.js:64:21
 
 const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
 const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
-const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  
+const myflshcardA = [];  
 const myLista = myflshcardA.map((item) => <p>{item}</p>)
 

[Survived] StringLiteral
components/FlashCard.js:64:73
 
 const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
 const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
-const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  
+const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green',""];  
 const myLista = myflshcardA.map((item) => <p>{item}</p>)
 

[Survived] ArrowFunction
components/FlashCard.js:65:33
 const myflshcardQ = ['supermaket price of milk','how meny poptart are in a box?', 'where can i find gatorade?','whick is hotter red or green salsa','can i have some more free samples'];  
 const myListq = myflshcardQ.map((item) => <p>{item}</p>) 
 const myflshcardA = [ '$3.49','ther are 4', 'there in the back','green','yes'];  
-const myLista = myflshcardA.map((item) => <p>{item}</p>)
+const myLista = myflshcardA.map(() => undefined)
 
