[NoCoverage] StringLiteral
components/FlashCardCreator.js:6:44
 import { useFonts } from "expo-font";
 
 export default function FlashCardCreator({ onCreate }) {
-  const [studySet, setStudySet] = useState('');
+  const [studySet, setStudySet] = useState("Stryker was here!");
   const [question, setQuestion] = useState('');
   const [answer, setAnswer] = useState('');

[NoCoverage] StringLiteral
components/FlashCardCreator.js:7:44
 
 export default function FlashCardCreator({ onCreate }) {
   const [studySet, setStudySet] = useState('');
-  const [question, setQuestion] = useState('');
+  const [question, setQuestion] = useState("Stryker was here!");
   const [answer, setAnswer] = useState('');
   const [dummy] = useFonts({

[NoCoverage] ObjectLiteral
components/FlashCardCreator.js:9:28
   const [studySet, setStudySet] = useState('');
   const [question, setQuestion] = useState('');
   const [answer, setAnswer] = useState('');
-  const [dummy] = useFonts({
-    "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),
-  });
+  const [dummy] = useFonts({});
 
   function handleSubmit() {

[NoCoverage] BlockStatement
components/FlashCardCreator.js:13:27
     "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),
   });
 
-  function handleSubmit() {
-    if (!studySet.trim() || (!question.trim() || !answer.trim())) {
-      Alert.alert('Error', 'Please fill out all fields');
-      return;
-    }
-
-    const newFlashcard = {
-      id: Date.now().toString(),
-      studySet,
-      question,
-      answer,
-    };
-
-    onCreate(newFlashcard);
-
-    setStudySet('');
-    setQuestion('');
-    setAnswer('');
-
-    Alert.alert('Success', 'Flashcard created successfully');
-  }
+  function handleSubmit() {}
 
   return (

[NoCoverage] ConditionalExpression
components/FlashCardCreator.js:14:30
   });
 
   function handleSubmit() {
-    if (!studySet.trim() || (!question.trim() || !answer.trim())) {
+    if (!studySet.trim() || (false)) {
       Alert.alert('Error', 'Please fill out all fields');
       return;

[NoCoverage] LogicalOperator
components/FlashCardCreator.js:14:30
   });
 
   function handleSubmit() {
-    if (!studySet.trim() || (!question.trim() || !answer.trim())) {
+    if (!studySet.trim() || (!question.trim() && !answer.trim())) {
       Alert.alert('Error', 'Please fill out all fields');
       return;

[NoCoverage] StringLiteral
components/FlashCardCreator.js:15:28
 
   function handleSubmit() {
     if (!studySet.trim() || (!question.trim() || !answer.trim())) {
-      Alert.alert('Error', 'Please fill out all fields');
+      Alert.alert('Error', "");
       return;
     }

[NoCoverage] StringLiteral
components/FlashCardCreator.js:32:28
     setQuestion('');
     setAnswer('');
 
-    Alert.alert('Success', 'Flashcard created successfully');
+    Alert.alert('Success', "");
   }
 

[NoCoverage] ArrayDeclaration
components/FlashCardCreator.js:40:18
       <View style={styles.formContainer}>
         <Text style={styles.legend}>New Flashcard</Text>
         <TextInput
-          style={[styles.input, styles.textInput]}
+          style={[]}
           placeholder="Study Set"
           placeholderTextColor="gray"

[NoCoverage] BooleanLiteral
components/FlashCardCreator.js:52:22
           placeholderTextColor="gray"
           value={question}
           onChangeText={setQuestion}
-          multiline={true}
+          multiline={false}
         />
         <TextInput

[NoCoverage] BooleanLiteral
components/FlashCardCreator.js:60:22
           placeholderTextColor="gray"
           value={answer}
           onChangeText={setAnswer}
-          multiline={true}
+          multiline={false}
         />
         <TouchableOpacity style={styles.button} onPress={handleSubmit}>

[Survived] StringLiteral
components/FlashCardCreator.js:78:18
     padding: 30,
     width: 300,
     borderRadius: 20,
-    shadowColor: '#000',
+    shadowColor: "",
     shadowOffset: { width: 5, height: 5 },
     shadowOpacity: 0.4,

[Survived] StringLiteral
components/FlashCardCreator.js:94:18
   },
   input: {
     backgroundColor: '#fff',
-    borderColor: '#000',
+    borderColor: "",
     borderRadius: 5,
     padding: 3,

[Survived] StringLiteral
components/FlashCardCreator.js:105:14
     borderColor: '#000',
   },
   button: {
-    display: 'inline-block',
+    display: "",
     alignSelf: 'center',
     backgroundColor: '#ffbbe0',

[Survived] StringLiteral
components/FlashCardCreator.js:106:16
   },
   button: {
     display: 'inline-block',
-    alignSelf: 'center',
+    alignSelf: "",
     backgroundColor: '#ffbbe0',
     paddingVertical: 10,

[Survived] StringLiteral
components/FlashCardCreator.js:113:18
     fontSize: 20,
     borderRadius: 10,
     borderWidth: 2,
-    borderColor: '#000',
+    borderColor: "",
   },
 });
