[NoCoverage] BlockStatement
components/FlashcardManagement.js:5:40
 
 // Handle errors with logging and throwing custom errors
 
-const handleError = (action, error) => {
-  console.error(`Error ${action}:`, error);
-  throw new Error(`Failed to ${action.toLowerCase()}`);
-};
+const handleError = (action, error) => {};
 
 // Get study sets from AsyncStorage

[NoCoverage] MethodExpression
components/FlashcardManagement.js:7:32
 
 const handleError = (action, error) => {
   console.error(`Error ${action}:`, error);
-  throw new Error(`Failed to ${action.toLowerCase()}`);
+  throw new Error(`Failed to ${action.toUpperCase()}`);
 };
 

[NoCoverage] BlockStatement
components/FlashcardManagement.js:11:41
 };
 
 // Get study sets from AsyncStorage
-export const getStudySets = async () => {
-  try {
-    // Retrieve stored study sets from AsyncStorage
-    const storedStudySets = await AsyncStorage.getItem('studySets');
-    // Return parsed study sets or empty array if none found
-    return storedStudySets ? JSON.parse(storedStudySets) : [];
-  } catch (error) {
-    // Handle errors if retrieval fails
-    handleError('retrieving study sets', error);
-  }
-};
+export const getStudySets = async () => {};
 
 // Save study sets to AsyncStorage

[NoCoverage] BlockStatement
components/FlashcardManagement.js:12:7
 
 // Get study sets from AsyncStorage
 export const getStudySets = async () => {
-  try {
-    // Retrieve stored study sets from AsyncStorage
-    const storedStudySets = await AsyncStorage.getItem('studySets');
-    // Return parsed study sets or empty array if none found
-    return storedStudySets ? JSON.parse(storedStudySets) : [];
-  } catch (error) {
+  try {} catch (error) {
     // Handle errors if retrieval fails
     handleError('retrieving study sets', error);

[NoCoverage] BlockStatement
components/FlashcardManagement.js:17:19
     const storedStudySets = await AsyncStorage.getItem('studySets');
     // Return parsed study sets or empty array if none found
     return storedStudySets ? JSON.parse(storedStudySets) : [];
-  } catch (error) {
-    // Handle errors if retrieval fails
-    handleError('retrieving study sets', error);
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
components/FlashcardManagement.js:19:17
     return storedStudySets ? JSON.parse(storedStudySets) : [];
   } catch (error) {
     // Handle errors if retrieval fails
-    handleError('retrieving study sets', error);
+    handleError("", error);
   }
 };

[NoCoverage] BlockStatement
components/FlashcardManagement.js:24:58
 };
 
 // Save study sets to AsyncStorage
-export const saveStudySets = async (updatedStudySets) => {
-  try {
-    // Save updated study sets to AsyncStorage as JSON string
-    await AsyncStorage.setItem('studySets', JSON.stringify(updatedStudySets));
-  } catch (error) {
-    // Handle errors if saving fails
-    handleError('saving study sets', error);
-  }
-};
+export const saveStudySets = async (updatedStudySets) => {};
 
 // Create or update flashcards in study sets

[NoCoverage] BlockStatement
components/FlashcardManagement.js:25:7
 
 // Save study sets to AsyncStorage
 export const saveStudySets = async (updatedStudySets) => {
-  try {
-    // Save updated study sets to AsyncStorage as JSON string
-    await AsyncStorage.setItem('studySets', JSON.stringify(updatedStudySets));
-  } catch (error) {
+  try {} catch (error) {
     // Handle errors if saving fails
     handleError('saving study sets', error);

[NoCoverage] StringLiteral
components/FlashcardManagement.js:27:32
 export const saveStudySets = async (updatedStudySets) => {
   try {
     // Save updated study sets to AsyncStorage as JSON string
-    await AsyncStorage.setItem('studySets', JSON.stringify(updatedStudySets));
+    await AsyncStorage.setItem("", JSON.stringify(updatedStudySets));
   } catch (error) {
     // Handle errors if saving fails

[NoCoverage] BlockStatement
components/FlashcardManagement.js:28:19
   try {
     // Save updated study sets to AsyncStorage as JSON string
     await AsyncStorage.setItem('studySets', JSON.stringify(updatedStudySets));
-  } catch (error) {
-    // Handle errors if saving fails
-    handleError('saving study sets', error);
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
components/FlashcardManagement.js:30:17
     await AsyncStorage.setItem('studySets', JSON.stringify(updatedStudySets));
   } catch (error) {
     // Handle errors if saving fails
-    handleError('saving study sets', error);
+    handleError("", error);
   }
 };

[NoCoverage] BlockStatement
components/FlashcardManagement.js:35:93
 };
 
 // Create or update flashcards in study sets
-export const createOrUpdateFlashcard = async (studySets, { studySet, question, answer }) => {
-  // Find existing study set with same title
-  const existingStudySet = studySets.find(set => set.title === studySet);
-
-  // Updating study sets based on existence of the study set
-  const updatedStudySets = existingStudySet
-    // If study set exists, updating its flashcards
-    ? studySets.map(set =>
-        set.title === studySet ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
-      )
-    // If study set does not exist, create new study set
-    : [...studySets, { title: studySet, flashcards: [{ question, answer }] }];
-
-  // Save updated study sets to AsyncStorage
-  await saveStudySets(updatedStudySets);
-};
+export const createOrUpdateFlashcard = async (studySets, { studySet, question, answer }) => {};
 
 // Remove flashcard from study sets

[NoCoverage] EqualityOperator
components/FlashcardManagement.js:37:50
 // Create or update flashcards in study sets
 export const createOrUpdateFlashcard = async (studySets, { studySet, question, answer }) => {
   // Find existing study set with same title
-  const existingStudySet = studySets.find(set => set.title === studySet);
+  const existingStudySet = studySets.find(set => set.title !== studySet);
 
   // Updating study sets based on existence of the study set

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:37:50
 // Create or update flashcards in study sets
 export const createOrUpdateFlashcard = async (studySets, { studySet, question, answer }) => {
   // Find existing study set with same title
-  const existingStudySet = studySets.find(set => set.title === studySet);
+  const existingStudySet = studySets.find(set => false);
 
   // Updating study sets based on existence of the study set

[NoCoverage] ArrowFunction
components/FlashcardManagement.js:42:21
   // Updating study sets based on existence of the study set
   const updatedStudySets = existingStudySet
     // If study set exists, updating its flashcards
-    ? studySets.map(set =>
-        set.title === studySet ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
+    ? studySets.map(() => undefined
       )
     // If study set does not exist, create new study set

[NoCoverage] EqualityOperator
components/FlashcardManagement.js:43:9
   const updatedStudySets = existingStudySet
     // If study set exists, updating its flashcards
     ? studySets.map(set =>
-        set.title === studySet ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
+        set.title !== studySet ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
       )
     // If study set does not exist, create new study set

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:43:9
   const updatedStudySets = existingStudySet
     // If study set exists, updating its flashcards
     ? studySets.map(set =>
-        set.title === studySet ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
+        false ? { ...set, flashcards: [...set.flashcards, { question, answer }] } : set
       )
     // If study set does not exist, create new study set

[NoCoverage] LogicalOperator
components/FlashcardManagement.js:59:9
     let studySets = await getStudySets();
 
     // Remove all study sets if both study set and question are empty
-    if (!studySet.trim() && !question.trim()) {
+    if (!studySet.trim() || !question.trim()) {
       studySets = [];
     } else if (!question.trim()) {

[NoCoverage] BlockStatement
components/FlashcardManagement.js:59:47
     let studySets = await getStudySets();
 
     // Remove all study sets if both study set and question are empty
-    if (!studySet.trim() && !question.trim()) {
-      studySets = [];
-    } else if (!question.trim()) {
+    if (!studySet.trim() && !question.trim()) {} else if (!question.trim()) {
       // Remove study set if only study set is provided
       studySets = studySets.filter(set => set.title !== studySet);

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:61:16
     // Remove all study sets if both study set and question are empty
     if (!studySet.trim() && !question.trim()) {
       studySets = [];
-    } else if (!question.trim()) {
+    } else if (true) {
       // Remove study set if only study set is provided
       studySets = studySets.filter(set => set.title !== studySet);

[NoCoverage] MethodExpression
components/FlashcardManagement.js:61:17
     // Remove all study sets if both study set and question are empty
     if (!studySet.trim() && !question.trim()) {
       studySets = [];
-    } else if (!question.trim()) {
+    } else if (!question) {
       // Remove study set if only study set is provided
       studySets = studySets.filter(set => set.title !== studySet);

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:63:43
       studySets = [];
     } else if (!question.trim()) {
       // Remove study set if only study set is provided
-      studySets = studySets.filter(set => set.title !== studySet);
+      studySets = studySets.filter(set => true);
     } else {
       // Remove specific flashcard from a study set

[NoCoverage] EqualityOperator
components/FlashcardManagement.js:63:43
       studySets = [];
     } else if (!question.trim()) {
       // Remove study set if only study set is provided
-      studySets = studySets.filter(set => set.title !== studySet);
+      studySets = studySets.filter(set => set.title === studySet);
     } else {
       // Remove specific flashcard from a study set

[NoCoverage] BlockStatement
components/FlashcardManagement.js:64:12
     } else if (!question.trim()) {
       // Remove study set if only study set is provided
       studySets = studySets.filter(set => set.title !== studySet);
-    } else {
-      // Remove specific flashcard from a study set
-      studySets = studySets.map(set => {
-        if (set.title === studySet) {
-          // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
-          // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
-        }
-        return set;
-      }).filter(Boolean);
-    }
+    } else {}
 
     // Save updated study sets to AsyncStorage after removal

[NoCoverage] BlockStatement
components/FlashcardManagement.js:66:40
       studySets = studySets.filter(set => set.title !== studySet);
     } else {
       // Remove specific flashcard from a study set
-      studySets = studySets.map(set => {
-        if (set.title === studySet) {
-          // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
-          // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
-        }
-        return set;
-      }).filter(Boolean);
+      studySets = studySets.map(set => {}).filter(Boolean);
     }
 

[NoCoverage] MethodExpression
components/FlashcardManagement.js:66:19
       studySets = studySets.filter(set => set.title !== studySet);
     } else {
       // Remove specific flashcard from a study set
-      studySets = studySets.map(set => {
-        if (set.title === studySet) {
-          // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
-          // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
-        }
-        return set;
-      }).filter(Boolean);
+      studySets = studySets.map(set => {
+  if (set.title === studySet) {
+    // Filter specific flashcard to be removed
+    const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
+    // Return null if no flashcards are left, otherwise update the flashcards
+    return updatedFlashcards.length === 0 ? null : {
+      ...set,
+      flashcards: updatedFlashcards
+    };
+  }
+  return set;
+});
     }
 

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:67:13
     } else {
       // Remove specific flashcard from a study set
       studySets = studySets.map(set => {
-        if (set.title === studySet) {
+        if (false) {
           // Filter specific flashcard to be removed
           const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);

[NoCoverage] BlockStatement
components/FlashcardManagement.js:67:37
     } else {
       // Remove specific flashcard from a study set
       studySets = studySets.map(set => {
-        if (set.title === studySet) {
-          // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
-          // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
-        }
+        if (set.title === studySet) {}
         return set;
       }).filter(Boolean);

[NoCoverage] ArrowFunction
components/FlashcardManagement.js:69:59
       studySets = studySets.map(set => {
         if (set.title === studySet) {
           // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
+          const updatedFlashcards = set.flashcards.filter(() => undefined);
           // Return null if no flashcards are left, otherwise update the flashcards
           return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:69:72
       studySets = studySets.map(set => {
         if (set.title === studySet) {
           // Filter specific flashcard to be removed
-          const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
+          const updatedFlashcards = set.flashcards.filter(flashcard => true);
           // Return null if no flashcards are left, otherwise update the flashcards
           return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };

[NoCoverage] EqualityOperator
components/FlashcardManagement.js:71:18
           // Filter specific flashcard to be removed
           const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
           // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
+          return updatedFlashcards.length !== 0 ? null : { ...set, flashcards: updatedFlashcards };
         }
         return set;

[NoCoverage] ConditionalExpression
components/FlashcardManagement.js:71:18
           // Filter specific flashcard to be removed
           const updatedFlashcards = set.flashcards.filter(flashcard => flashcard.question !== question);
           // Return null if no flashcards are left, otherwise update the flashcards
-          return updatedFlashcards.length === 0 ? null : { ...set, flashcards: updatedFlashcards };
+          return false ? null : { ...set, flashcards: updatedFlashcards };
         }
         return set;

[NoCoverage] BooleanLiteral
components/FlashcardManagement.js:80:12
     // Save updated study sets to AsyncStorage after removal
     await saveStudySets(studySets);
     // Indicate successful removal
-    return true;
+    return false;
   } catch (error) {
     // Handle errors if removal fails

[NoCoverage] BlockStatement
components/FlashcardManagement.js:81:19
     await saveStudySets(studySets);
     // Indicate successful removal
     return true;
-  } catch (error) {
-    // Handle errors if removal fails
-    handleError('removing flashcard', error);
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
components/FlashcardManagement.js:83:17
     return true;
   } catch (error) {
     // Handle errors if removal fails
-    handleError('removing flashcard', error);
+    handleError("", error);
   }
 };
