[NoCoverage] ObjectLiteral
components/FlashcardRemover.js:8:28
 export default function FlashcardRemover({ onRemove, onRemoveAll }) {
   const [studySet, setStudySet] = useState('');
   const [question, setQuestion] = useState('');
-  const [dummy] = useFonts({
-    "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),
-  });
+  const [dummy] = useFonts({});
 
   const handleEmptyFieldsError = () => {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:12:40
     "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),
   });
 
-  const handleEmptyFieldsError = () => {
-    Alert.alert('Error', 'Please fill out at least one field to remove a flashcard or leave question blank to remove an entire set.');
-  };
+  const handleEmptyFieldsError = () => {};
 
   const handleStudySetEmptyError = () => {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:16:42
     Alert.alert('Error', 'Please fill out at least one field to remove a flashcard or leave question blank to remove an entire set.');
   };
 
-  const handleStudySetEmptyError = () => {
-    Alert.alert('Error', 'Study Set cannot be empty.');
-  };
+  const handleStudySetEmptyError = () => {};
 
   const handleRemoveAllError = () => {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:20:38
     Alert.alert('Error', 'Study Set cannot be empty.');
   };
 
-  const handleRemoveAllError = () => {
-    Alert.alert('Error', 'In order to remove all flashcards and study sets, please leave both fields empty.');
-  };
+  const handleRemoveAllError = () => {};
 
   const handleConfirmRemoveAll = () => {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:24:40
     Alert.alert('Error', 'In order to remove all flashcards and study sets, please leave both fields empty.');
   };
 
-  const handleConfirmRemoveAll = () => {
-    Alert.alert(
-      'Remove All',
-      'Are you sure you want to remove all flashcards and study sets?',
-      [
-        {
-          text: 'Cancel',
-          onPress: () => console.log('Cancel Pressed'),
-          style: 'cancel'
-        },
-        {
-          text: 'Remove All',
-          onPress: () => {
-            onRemoveAll();
-            setStudySet('');
-            setQuestion('');
-          }
-        }
-      ],
-      { cancelable: true }
-    );
-  };
+  const handleConfirmRemoveAll = () => {};
 
   const handleRemoveAll = () => {

[NoCoverage] StringLiteral
components/FlashcardRemover.js:26:7
 
   const handleConfirmRemoveAll = () => {
     Alert.alert(
-      'Remove All',
+      "",
       'Are you sure you want to remove all flashcards and study sets?',
       [

[NoCoverage] ArrowFunction
components/FlashcardRemover.js:31:20
       [
         {
           text: 'Cancel',
-          onPress: () => console.log('Cancel Pressed'),
+          onPress: () => undefined,
           style: 'cancel'
         },

[NoCoverage] StringLiteral
components/FlashcardRemover.js:31:38
       [
         {
           text: 'Cancel',
-          onPress: () => console.log('Cancel Pressed'),
+          onPress: () => console.log(""),
           style: 'cancel'
         },

[NoCoverage] StringLiteral
components/FlashcardRemover.js:32:18
         {
           text: 'Cancel',
           onPress: () => console.log('Cancel Pressed'),
-          style: 'cancel'
+          style: ""
         },
         {

[NoCoverage] ObjectLiteral
components/FlashcardRemover.js:34:9
           onPress: () => console.log('Cancel Pressed'),
           style: 'cancel'
         },
-        {
-          text: 'Remove All',
-          onPress: () => {
-            onRemoveAll();
-            setStudySet('');
-            setQuestion('');
-          }
-        }
+        {}
       ],
       { cancelable: true }

[NoCoverage] BlockStatement
components/FlashcardRemover.js:36:26
         },
         {
           text: 'Remove All',
-          onPress: () => {
-            onRemoveAll();
-            setStudySet('');
-            setQuestion('');
-          }
+          onPress: () => {}
         }
       ],

[NoCoverage] BooleanLiteral
components/FlashcardRemover.js:43:21
           }
         }
       ],
-      { cancelable: true }
+      { cancelable: false }
     );
   };

[NoCoverage] BlockStatement
components/FlashcardRemover.js:47:33
     );
   };
 
-  const handleRemoveAll = () => {
-    if (studySet.trim() || question.trim()) {
-      handleRemoveAllError();
-    } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {
-      handleConfirmRemoveAll();
-    } else {
-      Alert.alert('Error', 'No study sets available to remove.');
-    }
-  };
+  const handleRemoveAll = () => {};
 
   const handleSubmit = () => {

[NoCoverage] MethodExpression
components/FlashcardRemover.js:48:28
   };
 
   const handleRemoveAll = () => {
-    if (studySet.trim() || question.trim()) {
+    if (studySet.trim() || question) {
       handleRemoveAllError();
     } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {

[NoCoverage] ConditionalExpression
components/FlashcardRemover.js:48:9
   };
 
   const handleRemoveAll = () => {
-    if (studySet.trim() || question.trim()) {
+    if (true) {
       handleRemoveAllError();
     } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {

[NoCoverage] EqualityOperator
components/FlashcardRemover.js:50:16
   const handleRemoveAll = () => {
     if (studySet.trim() || question.trim()) {
       handleRemoveAllError();
-    } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {
+    } else if (studySet.trim() !== '' && question.trim() === '' && onRemoveAll) {
       handleConfirmRemoveAll();
     } else {

[NoCoverage] ConditionalExpression
components/FlashcardRemover.js:50:16
   const handleRemoveAll = () => {
     if (studySet.trim() || question.trim()) {
       handleRemoveAllError();
-    } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {
+    } else if (true) {
       handleConfirmRemoveAll();
     } else {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:52:12
       handleRemoveAllError();
     } else if (studySet.trim() === '' && question.trim() === '' && onRemoveAll) {
       handleConfirmRemoveAll();
-    } else {
-      Alert.alert('Error', 'No study sets available to remove.');
-    }
+    } else {}
   };
 

[NoCoverage] BlockStatement
components/FlashcardRemover.js:57:30
     }
   };
 
-  const handleSubmit = () => {
-    if (!studySet.trim() && !question.trim()) {
-      handleEmptyFieldsError();
-    } else if (!studySet.trim()) {
-      handleStudySetEmptyError();
-    } else {
-      const removedFlashcard = {
-        studySet,
-        question,
-      };
-  
-      onRemove(removedFlashcard);
-  
-      setStudySet('');
-      setQuestion('');
-    }
-  };
+  const handleSubmit = () => {};
 
   return (

[NoCoverage] ConditionalExpression
components/FlashcardRemover.js:58:9
   };
 
   const handleSubmit = () => {
-    if (!studySet.trim() && !question.trim()) {
+    if (true) {
       handleEmptyFieldsError();
     } else if (!studySet.trim()) {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:58:47
   };
 
   const handleSubmit = () => {
-    if (!studySet.trim() && !question.trim()) {
-      handleEmptyFieldsError();
-    } else if (!studySet.trim()) {
+    if (!studySet.trim() && !question.trim()) {} else if (!studySet.trim()) {
       handleStudySetEmptyError();
     } else {

[NoCoverage] ConditionalExpression
components/FlashcardRemover.js:60:16
   const handleSubmit = () => {
     if (!studySet.trim() && !question.trim()) {
       handleEmptyFieldsError();
-    } else if (!studySet.trim()) {
+    } else if (false) {
       handleStudySetEmptyError();
     } else {

[NoCoverage] BooleanLiteral
components/FlashcardRemover.js:60:16
   const handleSubmit = () => {
     if (!studySet.trim() && !question.trim()) {
       handleEmptyFieldsError();
-    } else if (!studySet.trim()) {
+    } else if (studySet.trim()) {
       handleStudySetEmptyError();
     } else {

[NoCoverage] BlockStatement
components/FlashcardRemover.js:62:12
       handleEmptyFieldsError();
     } else if (!studySet.trim()) {
       handleStudySetEmptyError();
-    } else {
-      const removedFlashcard = {
-        studySet,
-        question,
-      };
-  
-      onRemove(removedFlashcard);
-  
-      setStudySet('');
-      setQuestion('');
-    }
+    } else {}
   };
 

[NoCoverage] ObjectLiteral
components/FlashcardRemover.js:63:32
     } else if (!studySet.trim()) {
       handleStudySetEmptyError();
     } else {
-      const removedFlashcard = {
-        studySet,
-        question,
-      };
+      const removedFlashcard = {};
   
       onRemove(removedFlashcard);

[NoCoverage] StringLiteral
components/FlashcardRemover.js:70:19
   
       onRemove(removedFlashcard);
   
-      setStudySet('');
+      setStudySet("Stryker was here!");
       setQuestion('');
     }

[Survived] ObjectLiteral
components/FlashcardRemover.js:132:10
     paddingBottom: 15,
     fontFamily: "Jua-Regular",
   },
-  input: {
-    backgroundColor: '#fff',
-    borderColor: '#000',
-    borderRadius: 5,
-    padding: 3,
-    fontSize: 16,
-    marginBottom: 15,
-    borderWidth: 2,
-    fontFamily: "Jua-Regular",
-  },
+  input: {},
   button: {
     display: 'inline-block',

[Survived] StringLiteral
components/FlashcardRemover.js:133:22
     fontFamily: "Jua-Regular",
   },
   input: {
-    backgroundColor: '#fff',
+    backgroundColor: "",
     borderColor: '#000',
     borderRadius: 5,

[Survived] ObjectLiteral
components/FlashcardRemover.js:142:11
     borderWidth: 2,
     fontFamily: "Jua-Regular",
   },
-  button: {
-    display: 'inline-block',
-    alignSelf: 'center',
-    backgroundColor: '#ffbbe0',
-    paddingVertical: 10,
-    paddingHorizontal: 50,
-    fontSize: 20,
-    borderRadius: 10,
-    borderWidth: 2,
-    borderColor: '#000',
-    marginBottom: 15,
-  },
+  button: {},
   removeAllButton: {
     alignSelf: 'center',

[Survived] StringLiteral
components/FlashcardRemover.js:145:22
   button: {
     display: 'inline-block',
     alignSelf: 'center',
-    backgroundColor: '#ffbbe0',
+    backgroundColor: "",
     paddingVertical: 10,
     paddingHorizontal: 50,
