[Survived] StringLiteral
components/minigame.js:6:15
 
 const questionsData = [
   {
-    question: 'What is the capital of France?',
+    question: "",
     answers: ['London', 'Paris', 'Berlin', 'Rome'],
     correctAnswerIndex: 1,

[Survived] ArrayDeclaration
components/minigame.js:7:14
 const questionsData = [
   {
     question: 'What is the capital of France?',
-    answers: ['London', 'Paris', 'Berlin', 'Rome'],
+    answers: [],
     correctAnswerIndex: 1,
   },

[Survived] ObjectLiteral
components/minigame.js:10:3
     answers: ['London', 'Paris', 'Berlin', 'Rome'],
     correctAnswerIndex: 1,
   },
-  {
-    question: 'What is the largest planet in our solar system?',
-    answers: ['Jupiter', 'Mars', 'Earth', 'Venus'],
-    correctAnswerIndex: 0,
-  },
+  {},
   {
     question: 'Who wrote "To Kill a Mockingbird"?',

[Survived] StringLiteral
components/minigame.js:12:43
   },
   {
     question: 'What is the largest planet in our solar system?',
-    answers: ['Jupiter', 'Mars', 'Earth', 'Venus'],
+    answers: ['Jupiter', 'Mars', 'Earth', ""],
     correctAnswerIndex: 0,
   },

[Survived] StringLiteral
components/minigame.js:16:15
     correctAnswerIndex: 0,
   },
   {
-    question: 'Who wrote "To Kill a Mockingbird"?',
+    question: "",
     answers: ['Stephen King', 'Harper Lee', 'J.K. Rowling', 'Charles Dickens'],
     correctAnswerIndex: 1,

[Survived] StringLiteral
components/minigame.js:17:45
   },
   {
     question: 'Who wrote "To Kill a Mockingbird"?',
-    answers: ['Stephen King', 'Harper Lee', 'J.K. Rowling', 'Charles Dickens'],
+    answers: ['Stephen King', 'Harper Lee', "", 'Charles Dickens'],
     correctAnswerIndex: 1,
   },

[Survived] StringLiteral
components/minigame.js:17:15
   },
   {
     question: 'Who wrote "To Kill a Mockingbird"?',
-    answers: ['Stephen King', 'Harper Lee', 'J.K. Rowling', 'Charles Dickens'],
+    answers: ["", 'Harper Lee', 'J.K. Rowling', 'Charles Dickens'],
     correctAnswerIndex: 1,
   },

[Survived] StringLiteral
components/minigame.js:21:15
     correctAnswerIndex: 1,
   },
   {
-    question: 'Which element has the chemical symbol "Fe"?',
+    question: "",
     answers: ['Iron', 'Gold', 'Silver', 'Copper'],
     correctAnswerIndex: 0,

[Survived] StringLiteral
components/minigame.js:22:15
   },
   {
     question: 'Which element has the chemical symbol "Fe"?',
-    answers: ['Iron', 'Gold', 'Silver', 'Copper'],
+    answers: ["", 'Gold', 'Silver', 'Copper'],
     correctAnswerIndex: 0,
   },

[Survived] ObjectLiteral
components/minigame.js:25:3
     answers: ['Iron', 'Gold', 'Silver', 'Copper'],
     correctAnswerIndex: 0,
   },
-  {
-    question: 'What is the powerhouse of the cell?',
-    answers: ['Nucleus', 'Cell membrane', 'Mitochondria', 'Endoplasmic reticulum'],
-    correctAnswerIndex: 2,
-  },
+  {},
 ];
 

[Survived] StringLiteral
components/minigame.js:26:15
     correctAnswerIndex: 0,
   },
   {
-    question: 'What is the powerhouse of the cell?',
+    question: "",
     answers: ['Nucleus', 'Cell membrane', 'Mitochondria', 'Endoplasmic reticulum'],
     correctAnswerIndex: 2,

[Survived] StringLiteral
components/minigame.js:27:26
   },
   {
     question: 'What is the powerhouse of the cell?',
-    answers: ['Nucleus', 'Cell membrane', 'Mitochondria', 'Endoplasmic reticulum'],
+    answers: ['Nucleus', "", 'Mitochondria', 'Endoplasmic reticulum'],
     correctAnswerIndex: 2,
   },

[NoCoverage] EqualityOperator
components/minigame.js:40:9
 
   const handleAnswerSelection = (selectedAnswerIndex) => {
     const currentQuestion = questionsData[currentQuestionIndex];
-    if (selectedAnswerIndex === currentQuestion.correctAnswerIndex) {
+    if (selectedAnswerIndex !== currentQuestion.correctAnswerIndex) {
       setScore(score + 1);
     }

[NoCoverage] ConditionalExpression
components/minigame.js:44:9
       setScore(score + 1);
     }
 
-    if (currentQuestionIndex === questionsData.length - 1) {
+    if (false) {
       setGameOver(true);
     } else {

[NoCoverage] BlockStatement
components/minigame.js:51:29
     }
   };
 
-  const restartGame = () => {
-    setCurrentQuestionIndex(0);
-    setScore(0);
-    setGameOver(false);
-  };
+  const restartGame = () => {};
 
   if (gameOver) {

[NoCoverage] BooleanLiteral
components/minigame.js:54:17
   const restartGame = () => {
     setCurrentQuestionIndex(0);
     setScore(0);
-    setGameOver(false);
+    setGameOver(true);
   };
 

[NoCoverage] BlockStatement
components/minigame.js:57:17
     setGameOver(false);
   };
 
-  if (gameOver) {
-    return (
-      <View style={styles.container}>
-        <View style={styles.gameContainer}>
-          <View style={styles.gameOverContainer}>
-              <Text style={styles.finishedText}>Finished!</Text>
-              <Text style={styles.resultText}>
-                You got {score} out of {questionsData.length} correct!
-              </Text>
-              <TouchableOpacity style={styles.button} onPress={restartGame}>
-                <Text style={styles.buttonText}>Play Again</Text>
-              </TouchableOpacity>
-          </View>
-        </View>
-      </View>
-    );
-  }
+  if (gameOver) {}
 
   return (

[NoCoverage] EqualityOperator
components/minigame.js:84:42
         {questionsData[currentQuestionIndex].answers.map((answer, index) => (
           <TouchableOpacity
             key={index}
-            style={[styles.answerButton, index === hoveredIndex && styles.answerButtonHover]}
+            style={[styles.answerButton, index !== hoveredIndex && styles.answerButtonHover]}
             activeOpacity={0.7}
             onPress={() => handleAnswerSelection(index)}

[Survived] StringLiteral
components/minigame.js:112:18
     borderRadius: 15,
     width: '100%',
     alignItems: 'center',
-    shadowColor: '#000',
+    shadowColor: "",
     shadowOffset: {
       width: 4,

[Survived] ObjectLiteral
components/minigame.js:121:22
     shadowRadius: 3.84,
     elevation: 5,
   },
-  questionContainer: {
-    marginBottom: 20,
-  },
+  questionContainer: {},
   question: {
     fontSize: 24,

[Survived] StringLiteral
components/minigame.js:152:22
     justifyContent: 'center',
   },
   whiteContainer: {
-    backgroundColor: 'white',
+    backgroundColor: "",
     padding: 40,
     borderRadius: 15,

[Survived] ObjectLiteral
components/minigame.js:180:11
     textAlign: 'center',
     fontFamily: 'Jua-Regular',
   },
-  button: {
-    backgroundColor: '#6C99BB',
-    paddingVertical: 15,
-    paddingHorizontal: 30,
-    borderRadius: 10,
-    marginTop: 20,
-  },
+  button: {},
   buttonText: {
     fontSize: 16,

[Survived] ObjectLiteral
components/minigame.js:187:15
     borderRadius: 10,
     marginTop: 20,
   },
-  buttonText: {
-    fontSize: 16,
-    fontWeight: 'bold',
-    color: 'black',
-    fontFamily: 'Jua-Regular',
-  },
+  buttonText: {},
 });
 
