[Timeout] ObjectLiteral
components/Pet.js:8:18
 class Pet extends Component {
   constructor(props) {
     super(props);
-    this.state = {
-      images: [
-        require('./animatedFrog.gif'),
-        require('./animatedFrog(sad).gif'),
-        require('./animatedFrog(happy).gif'),
-        require('./animatedFrog(happy).gif'),
-        require('./animatedFrog(dead).gif'),
-      ],
-      currentImageIndex: 0,
-      name: 'Firulai',
-      growthlvl: 0,
-      hunger: 0,
-      happiness: 100,
-      lastInteractionTime: new Date(),
-      careMistakes: 0,
-    };
+    this.state = {};
   }
 

[Timeout] ArrayDeclaration
components/Pet.js:9:15
   constructor(props) {
     super(props);
     this.state = {
-      images: [
-        require('./animatedFrog.gif'),
-        require('./animatedFrog(sad).gif'),
-        require('./animatedFrog(happy).gif'),
-        require('./animatedFrog(happy).gif'),
-        require('./animatedFrog(dead).gif'),
-      ],
+      images: [],
       currentImageIndex: 0,
       name: 'Firulai',

[NoCoverage] BlockStatement
components/Pet.js:29:48
   componentDidMount() {
     this.loadData();
     // Simulate happiness increasing over time
-    this.happinessInterval = setInterval(() => {
-      if (this.state.happiness < 100) {
-        this.setState((prevState) => ({
-          happiness: prevState.happiness + 10,
-        }));
-      } else {
-        clearInterval(this.happinessInterval);
-      }
-    }, 1000);
+    this.happinessInterval = setInterval(() => {}, 1000);
 
     // Switch images every 3 seconds

[NoCoverage] ConditionalExpression
components/Pet.js:30:11
     this.loadData();
     // Simulate happiness increasing over time
     this.happinessInterval = setInterval(() => {
-      if (this.state.happiness < 100) {
+      if (false) {
         this.setState((prevState) => ({
           happiness: prevState.happiness + 10,

[NoCoverage] EqualityOperator
components/Pet.js:30:11
     this.loadData();
     // Simulate happiness increasing over time
     this.happinessInterval = setInterval(() => {
-      if (this.state.happiness < 100) {
+      if (this.state.happiness <= 100) {
         this.setState((prevState) => ({
           happiness: prevState.happiness + 10,

[NoCoverage] ArrowFunction
components/Pet.js:31:23
     // Simulate happiness increasing over time
     this.happinessInterval = setInterval(() => {
       if (this.state.happiness < 100) {
-        this.setState((prevState) => ({
-          happiness: prevState.happiness + 10,
-        }));
+        this.setState(() => undefined);
       } else {
         clearInterval(this.happinessInterval);

[NoCoverage] ArithmeticOperator
components/Pet.js:32:22
     this.happinessInterval = setInterval(() => {
       if (this.state.happiness < 100) {
         this.setState((prevState) => ({
-          happiness: prevState.happiness + 10,
+          happiness: prevState.happiness - 10,
         }));
       } else {

[NoCoverage] BlockStatement
components/Pet.js:34:14
         this.setState((prevState) => ({
           happiness: prevState.happiness + 10,
         }));
-      } else {
-        clearInterval(this.happinessInterval);
-      }
+      } else {}
     }, 1000);
 

[NoCoverage] BlockStatement
components/Pet.js:40:44
     }, 1000);
 
     // Switch images every 3 seconds
-    this.imageInterval = setInterval(() => {
-      this.setState((prevState) => ({
-        currentImageIndex: (prevState.currentImageIndex + 1) % this.state.images.length,
-      }));
-    }, 3000);
+    this.imageInterval = setInterval(() => {}, 3000);
 
     // Check for care mistakes every 15 minutes

[NoCoverage] ArrowFunction
components/Pet.js:41:21
 
     // Switch images every 3 seconds
     this.imageInterval = setInterval(() => {
-      this.setState((prevState) => ({
-        currentImageIndex: (prevState.currentImageIndex + 1) % this.state.images.length,
-      }));
+      this.setState(() => undefined);
     }, 3000);
 

[NoCoverage] ArithmeticOperator
components/Pet.js:42:28
     // Switch images every 3 seconds
     this.imageInterval = setInterval(() => {
       this.setState((prevState) => ({
-        currentImageIndex: (prevState.currentImageIndex + 1) % this.state.images.length,
+        currentImageIndex: (prevState.currentImageIndex + 1) * this.state.images.length,
       }));
     }, 3000);

[NoCoverage] ArithmeticOperator
components/Pet.js:42:29
     // Switch images every 3 seconds
     this.imageInterval = setInterval(() => {
       this.setState((prevState) => ({
-        currentImageIndex: (prevState.currentImageIndex + 1) % this.state.images.length,
+        currentImageIndex: (prevState.currentImageIndex - 1) % this.state.images.length,
       }));
     }, 3000);

[NoCoverage] BlockStatement
components/Pet.js:47:50
     }, 3000);
 
     // Check for care mistakes every 15 minutes
-    this.careMistakeInterval = setInterval(() => {
-      const currentTime = new Date();
-      const lastInteractionTime = new Date(this.state.lastInteractionTime);
-      const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
-
-      if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
-        this.setState((prevState) => ({
-          careMistakes: prevState.careMistakes + 1,
-        }));
-      }
-    }, 1000 * 60 * 15);
+    this.careMistakeInterval = setInterval(() => {}, 1000 * 60 * 15);
   }
 

[NoCoverage] ArithmeticOperator
components/Pet.js:50:69
     this.careMistakeInterval = setInterval(() => {
       const currentTime = new Date();
       const lastInteractionTime = new Date(this.state.lastInteractionTime);
-      const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
+      const timeDifference = (currentTime - lastInteractionTime) / (1000 / 60); // in minutes
 
       if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {

[NoCoverage] ArithmeticOperator
components/Pet.js:50:31
     this.careMistakeInterval = setInterval(() => {
       const currentTime = new Date();
       const lastInteractionTime = new Date(this.state.lastInteractionTime);
-      const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
+      const timeDifference = (currentTime + lastInteractionTime) / (1000 * 60); // in minutes
 
       if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {

[NoCoverage] EqualityOperator
components/Pet.js:52:11
       const lastInteractionTime = new Date(this.state.lastInteractionTime);
       const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
 
-      if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
+      if (timeDifference > 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
         this.setState((prevState) => ({
           careMistakes: prevState.careMistakes + 1,

[NoCoverage] EqualityOperator
components/Pet.js:52:36
       const lastInteractionTime = new Date(this.state.lastInteractionTime);
       const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
 
-      if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
+      if (timeDifference >= 15 && (this.state.happiness !== 0 || this.state.hunger === 100)) {
         this.setState((prevState) => ({
           careMistakes: prevState.careMistakes + 1,

[NoCoverage] ArrowFunction
components/Pet.js:53:23
       const timeDifference = (currentTime - lastInteractionTime) / (1000 * 60); // in minutes
 
       if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
-        this.setState((prevState) => ({
-          careMistakes: prevState.careMistakes + 1,
-        }));
+        this.setState(() => undefined);
       }
     }, 1000 * 60 * 15);

[NoCoverage] ArithmeticOperator
components/Pet.js:54:25
 
       if (timeDifference >= 15 && (this.state.happiness === 0 || this.state.hunger === 100)) {
         this.setState((prevState) => ({
-          careMistakes: prevState.careMistakes + 1,
+          careMistakes: prevState.careMistakes - 1,
         }));
       }

[Timeout] ArithmeticOperator
components/Pet.js:57:8
           careMistakes: prevState.careMistakes + 1,
         }));
       }
-    }, 1000 * 60 * 15);
+    }, 1000 * 60 / 15);
   }
 

[Timeout] ArithmeticOperator
components/Pet.js:57:8
           careMistakes: prevState.careMistakes + 1,
         }));
       }
-    }, 1000 * 60 * 15);
+    }, 1000 / 60 * 15);
   }
 

[Timeout] BlockStatement
components/Pet.js:60:26
     }, 1000 * 60 * 15);
   }
 
-  componentWillUnmount() {
-    this.saveData();
-    clearInterval(this.happinessInterval);
-    clearInterval(this.imageInterval);
-    clearInterval(this.careMistakeInterval);
-  }
+  componentWillUnmount() {}
 
   async saveData() {

[Timeout] BlockStatement
components/Pet.js:67:20
     clearInterval(this.careMistakeInterval);
   }
 
-  async saveData() {
-    try {
-      await AsyncStorage.setItem('petData', JSON.stringify(this.state));
-    } catch (error) {
-      console.error('Error saving data:', error);
-    }
-  }
+  async saveData() {}
   async loadData() {
     try {

[Timeout] BlockStatement
components/Pet.js:68:9
   }
 
   async saveData() {
-    try {
-      await AsyncStorage.setItem('petData', JSON.stringify(this.state));
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error saving data:', error);
     }

[NoCoverage] BlockStatement
components/Pet.js:70:21
   async saveData() {
     try {
       await AsyncStorage.setItem('petData', JSON.stringify(this.state));
-    } catch (error) {
-      console.error('Error saving data:', error);
-    }
+    } catch (error) {}
   }
   async loadData() {

[NoCoverage] StringLiteral
components/Pet.js:71:21
     try {
       await AsyncStorage.setItem('petData', JSON.stringify(this.state));
     } catch (error) {
-      console.error('Error saving data:', error);
+      console.error("", error);
     }
   }

[Timeout] BlockStatement
components/Pet.js:74:20
       console.error('Error saving data:', error);
     }
   }
-  async loadData() {
-    try {
-      const petData = await AsyncStorage.getItem('petData');
-      if (petData != null) {
-        this.setState(JSON.parse(petData));
-      } else {
-        console.error('Error loading data: Retrieved data is undefined');
-        // Set default values for state properties
-        this.setState({
-          images: this.state.images, // Keep existing images array
-          currentImageIndex: this.state.currentImageIndex, // Keep existing currentImageIndex
-          name: 'Firulai',
-          growthlvl: 0,
-          hunger: 0,
-          happiness: 100,
-          lastInteractionTime: new Date(),
-          careMistakes: 0,
-        });
-      }
-    } catch (error) {
-      console.error('Error loading data:', error);
-    }
-  }
+  async loadData() {}
   
 

[Killed] BlockStatement
components/Pet.js:75:9
     }
   }
   async loadData() {
-    try {
-      const petData = await AsyncStorage.getItem('petData');
-      if (petData != null) {
-        this.setState(JSON.parse(petData));
-      } else {
-        console.error('Error loading data: Retrieved data is undefined');
-        // Set default values for state properties
-        this.setState({
-          images: this.state.images, // Keep existing images array
-          currentImageIndex: this.state.currentImageIndex, // Keep existing currentImageIndex
-          name: 'Firulai',
-          growthlvl: 0,
-          hunger: 0,
-          happiness: 100,
-          lastInteractionTime: new Date(),
-          careMistakes: 0,
-        });
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error loading data:', error);
     }
killedBy: Pet component handles error loading data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data:", Any<Error>

Number of calls: 0

[Killed] ConditionalExpression
components/Pet.js:77:11
   async loadData() {
     try {
       const petData = await AsyncStorage.getItem('petData');
-      if (petData != null) {
+      if (true) {
         this.setState(JSON.parse(petData));
       } else {
killedBy: Pet component handles undefined data when loading
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data: Retrieved data is undefined"

Number of calls: 0

[Killed] EqualityOperator
components/Pet.js:77:11
   async loadData() {
     try {
       const petData = await AsyncStorage.getItem('petData');
-      if (petData != null) {
+      if (petData == null) {
         this.setState(JSON.parse(petData));
       } else {
killedBy: Pet component handles undefined data when loading
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data: Retrieved data is undefined"

Number of calls: 0

[Killed] BlockStatement
components/Pet.js:79:14
       const petData = await AsyncStorage.getItem('petData');
       if (petData != null) {
         this.setState(JSON.parse(petData));
-      } else {
-        console.error('Error loading data: Retrieved data is undefined');
-        // Set default values for state properties
-        this.setState({
-          images: this.state.images, // Keep existing images array
-          currentImageIndex: this.state.currentImageIndex, // Keep existing currentImageIndex
-          name: 'Firulai',
-          growthlvl: 0,
-          hunger: 0,
-          happiness: 100,
-          lastInteractionTime: new Date(),
-          careMistakes: 0,
-        });
-      }
+      } else {}
     } catch (error) {
       console.error('Error loading data:', error);
killedBy: Pet component handles undefined data when loading
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data: Retrieved data is undefined"

Number of calls: 0

[Survived] StringLiteral
components/Pet.js:85:17
         this.setState({
           images: this.state.images, // Keep existing images array
           currentImageIndex: this.state.currentImageIndex, // Keep existing currentImageIndex
-          name: 'Firulai',
+          name: "",
           growthlvl: 0,
           hunger: 0,

[Killed] BlockStatement
components/Pet.js:93:21
           careMistakes: 0,
         });
       }
-    } catch (error) {
-      console.error('Error loading data:', error);
-    }
+    } catch (error) {}
   }
   
killedBy: Pet component handles error loading data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
components/Pet.js:94:21
         });
       }
     } catch (error) {
-      console.error('Error loading data:', error);
+      console.error("", error);
     }
   }
killedBy: Pet component handles error loading data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error loading data:", Any<Error>
Received: "", [Error: Data retrieval error]

Number of calls: 1

[NoCoverage] BlockStatement
components/Pet.js:99:29
   }
   
 
-  handleInteraction = () => {
-    this.setState({
-      lastInteractionTime: new Date(),
-    });
-  };
+  handleInteraction = () => {};
 
   render() {

[Survived] BlockStatement
components/Pet.js:105:12
     });
   };
 
-  render() {
-    const { happiness, name, images, currentImageIndex, careMistakes } = this.state;
-
-    return (
-      <View>
-        <Image source={images[currentImageIndex]} style={styles.image} />
-        <Text style={styles.name}>{name}</Text>
-        {/* <Text>Care Mistakes: {careMistakes}</Text> */}
-        {/* Uncomment line above to show care mistakes on the screen */}
-      </View>
-    );
-  }
+  render() {}
 }
 

[Survived] ObjectLiteral
components/Pet.js:120:9
 }
 
 const styles = StyleSheet.create({
-  name: {
-    alignItems: 'center',
-    color: '#288a42',
-    fontSize: 30,
-  },
+  name: {},
   image: {
     width: 200,
