[NoCoverage] BlockStatement
components/Progressbar.js:5:12
 import { View, Text, StyleSheet } from 'react-native';
 
 class ProgressBar extends Component {
-  render() {
-    const { progress, title } = this.props;
-    
-
-    return (
-        <View style={styles.container}>
-        <Text style={styles.title}>{title}</Text>
-        <View style={styles.progressBarContainer}>
-          <View style={[styles.progressBar, { width: `${progress}%` }]} />
-          
-        </View>
-        <Text style={styles.text}>{progress}%</Text>
-      </View>
-    );
-  }
+  render() {}
 }
 

[NoCoverage] ObjectLiteral
components/Progressbar.js:13:45
         <View style={styles.container}>
         <Text style={styles.title}>{title}</Text>
         <View style={styles.progressBarContainer}>
-          <View style={[styles.progressBar, { width: `${progress}%` }]} />
+          <View style={[styles.progressBar, {}]} />
           
         </View>

[NoCoverage] StringLiteral
components/Progressbar.js:13:54
         <View style={styles.container}>
         <Text style={styles.title}>{title}</Text>
         <View style={styles.progressBarContainer}>
-          <View style={[styles.progressBar, { width: `${progress}%` }]} />
+          <View style={[styles.progressBar, { width: `` }]} />
           
         </View>

[NoCoverage] ObjectLiteral
components/Progressbar.js:22:34
   }
 }
 
-const styles = StyleSheet.create({
-    container: {
-      alignItems: 'center',
-    },
-    title: {
-      fontSize: 18,
-      marginBottom: 5,
-    },
-    progressBarContainer: {
-      width: '80%',
-      height: 30,
-      backgroundColor: '#e0e0e0',
-      borderRadius: 5,
-      overflow: 'hidden',
-    },
-    progressBar: {
-      height: '100%',
-      backgroundColor: '#4caf50',
-    },
-    text: {
-      marginTop: 5,
-      fontSize: 16,
-      color: '#000',
-    },
-});
+const styles = StyleSheet.create({});
 
 export default ProgressBar;

[NoCoverage] StringLiteral
components/Progressbar.js:31:14
       marginBottom: 5,
     },
     progressBarContainer: {
-      width: '80%',
+      width: "",
       height: 30,
       backgroundColor: '#e0e0e0',

[NoCoverage] StringLiteral
components/Progressbar.js:33:24
     progressBarContainer: {
       width: '80%',
       height: 30,
-      backgroundColor: '#e0e0e0',
+      backgroundColor: "",
       borderRadius: 5,
       overflow: 'hidden',

[NoCoverage] StringLiteral
components/Progressbar.js:35:17
       height: 30,
       backgroundColor: '#e0e0e0',
       borderRadius: 5,
-      overflow: 'hidden',
+      overflow: "",
     },
     progressBar: {
