[NoCoverage] BlockStatement
components/StudySet.js:5:55
 import { StyleSheet, Text, View } from 'react-native';
 import { useFonts } from "expo-font";
 
-export default function StudySet({ title, children }) {
-  const [dummy] = useFonts({
-    "Jua-Regular": require("../assets/fonts/Jua-Regular.ttf"),
-  });
-
-  return (
-    <View style={styles.container}>
-      <Text style={styles.title}>{title}</Text>
-      <View style={styles.content}>
-        {children}
-      </View>
-    </View>
-  );
-}
+export default function StudySet({ title, children }) {}
 
 const styles = StyleSheet.create({

[Survived] ObjectLiteral
components/StudySet.js:21:14
 }
 
 const styles = StyleSheet.create({
-  container: {
-    marginTop: 20,
-    marginBottom: 25,
-    backgroundColor: '#fff',
-    padding: 5,
-    maxWidth: 500,
-    width: 330,
-    borderRadius: 20,
-    shadowColor: '#000',
-    shadowOffset: { width: 5, height: 5 },
-    shadowOpacity: 0.4,
-    shadowRadius: 3,
-  },
+  container: {},
   title: {
     fontSize: 18,

[Survived] StringLiteral
components/StudySet.js:38:16
     fontSize: 18,
     fontWeight: 'bold',
     maxWidth: 600,
-    textAlign: 'center',
+    textAlign: "",
     marginTop: 20,
     fontFamily: 'Jua-Regular',

[Survived] StringLiteral
components/StudySet.js:40:17
     maxWidth: 600,
     textAlign: 'center',
     marginTop: 20,
-    fontFamily: 'Jua-Regular',
+    fontFamily: "",
   },
   content: {

[Survived] ObjectLiteral
components/StudySet.js:42:12
     marginTop: 20,
     fontFamily: 'Jua-Regular',
   },
-  content: {
-    marginTop: 20,
-    marginBottom: 20,
-  },
+  content: {},
 });
 
