[Killed] BlockStatement
components/User.js:5:22
 import { View, Text } from 'react-native';
 
 class User extends Component {
-  constructor(props) {
-    super(props);
-    this.state = {
-      name: props.name || '',
-      pets: props.pets || [],
-      exams: props.exams || []
-    };
-  }
+  constructor(props) {}
 
   render() {
killedBy: User component renders with default props
statusReason: ReferenceError: this hasn't been initialised - super() hasn't been called

[Killed] LogicalOperator
components/User.js:8:13
   constructor(props) {
     super(props);
     this.state = {
-      name: props.name || '',
+      name: props.name && '',
       pets: props.pets || [],
       exams: props.exams || []
killedBy: User component renders with custom name
statusReason: Error: Unable to find an element with text: Name: John

<View>
  <Text>
    Name: 
  </Text>
  <Text>
    Pets:

[Killed] ConditionalExpression
components/User.js:8:13
   constructor(props) {
     super(props);
     this.state = {
-      name: props.name || '',
+      name: false,
       pets: props.pets || [],
       exams: props.exams || []
killedBy: User component renders with custom name
statusReason: Error: Unable to find an element with text: Name: John

<View>
  <Text>
    Name: 
  </Text>
  <Text>
    Pets:

[Killed] ConditionalExpression
components/User.js:9:13
     super(props);
     this.state = {
       name: props.name || '',
-      pets: props.pets || [],
+      pets: true,
       exams: props.exams || []
     };
killedBy: User component renders with default props
statusReason: TypeError: pets.map is not a function

[Killed] ConditionalExpression
components/User.js:9:13
     super(props);
     this.state = {
       name: props.name || '',
-      pets: props.pets || [],
+      pets: false,
       exams: props.exams || []
     };
killedBy: User component renders with default props
statusReason: TypeError: pets.map is not a function

[Killed] LogicalOperator
components/User.js:10:14
     this.state = {
       name: props.name || '',
       pets: props.pets || [],
-      exams: props.exams || []
+      exams: props.exams && []
     };
   }
killedBy: User component renders with default props
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
components/User.js:10:14
     this.state = {
       name: props.name || '',
       pets: props.pets || [],
-      exams: props.exams || []
+      exams: true
     };
   }
killedBy: User component renders with default props
statusReason: TypeError: exams.map is not a function

[Killed] BlockStatement
components/User.js:14:12
     };
   }
 
-  render() {
-    const { name, pets, exams } = this.state;
-
-    return (
-      <View>
-        <Text>Name: {name}</Text>
-        <Text>Pets:</Text>
-        <View>
-          {pets.map((pet, index) => (
-            <Text key={index}>{pet.name}</Text>
-          ))}
-        </View>
-        <Text>Exams:</Text>
-        <View>
-          {exams.map((exam, index) => (
-            <Text key={index}>{exam.toString()}</Text>
-          ))}
-        </View>
-      </View>
-    );
-  }
+  render() {}
 }
 
killedBy: User component renders with default props
statusReason: Error: Unable to find an element with text: Name:

[Killed] ArrowFunction
components/User.js:22:21
         <Text>Name: {name}</Text>
         <Text>Pets:</Text>
         <View>
-          {pets.map((pet, index) => (
-            <Text key={index}>{pet.name}</Text>
-          ))}
+          {pets.map(() => undefined)}
         </View>
         <Text>Exams:</Text>
killedBy: User component renders with custom name
statusReason: Error: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: object. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Pet`.

[Killed] ArrowFunction
components/User.js:28:22
         </View>
         <Text>Exams:</Text>
         <View>
-          {exams.map((exam, index) => (
-            <Text key={index}>{exam.toString()}</Text>
-          ))}
+          {exams.map(() => undefined)}
         </View>
       </View>
killedBy: User component renders with custom name
statusReason: Error: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: object. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Pet`.
